;; 아래 문서를 사용하여 elisp의 문법을 정리합니다.
;; http://ageofblue.blogspot.kr/2012/01/emacs-lisp-1.html
;; 

;; 1. List
;; Lisp는 List로 구성된 계산식을 해석하는 언어다. 따라서 언어의 근간을 이루는 데이터 구조인 List를 이해하는 것은 매우 중요합니다.
;; cons(constructor) : list를 만드는 함수
;; param1 : car(address)
;; param2 : cdr(decrement)
;; return : cons
(cons 1 2)

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;           +---> 2 (cdr)   ;;
;;  cons     |               ;;
;;     +---+-|-+             ;;
;;     | o | o |             ;;
;;     +-|-+---+             ;;
;;       |                   ;;
;;       +---> 1 (car)       ;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;; 하나의 콘스 구조
;; 각각의 박스는 값을 가리킵니다.
;; 값 1과 2는 car와 cdr로 접근할 수 있습니다.
;; car : cons를 인자로 받아 첫번째 값 1을 반환합니다.
;; cdr : cons를 인자로 받아 두번째 값 2를 반환합니다.

(car (cons 1 2))
(cdr (cons 1 2))

;; 좀더 복잡한 cons 구조입니다.
(cons 1 (cons 2 (cons 3 4)))
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;  cons          cons          cons                 ;;
;;     +---+---+     +---+---+     +---+---+         ;;
;;     | o | o------>| o | o------>| o | o------> 4  ;;
;;     +-|-+---+     +-|-+---+     +-|-+---+         ;;
;;       |             |             |               ;;
;;       +---> 1       +---> 2       +---> 3         ;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;; 위 cons 구조는 lisp의 모든 데이터 구조의 기본입니다.
;; cons의 오른쪽 박스가 다른 cons 구조를 가리킵니다.
;; 이러한 방식으로 여러 개의 cons를 묶을 수 있습니다.
;; list 또한 cons의 구조를 활용하여 표현할 수 있습니다.
;; list의 끝을 나타내기 위해 nil을 마지막 원소로 넣습니다.

(cons 1 nil)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;  cons                   ;;             
;;     +---+---+           ;;
;;     | o | o------> nil  ;;
;;     +-|-+---+           ;;
;;       |                 ;;
;;       +---> 1           ;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;


(cons 1 (cons 2 (cons 3 nil)))
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;  cons          cons          cons                   ;;
;;     +---+---+     +---+---+     +---+---+           ;;
;;     | o | o------>| o | o------>| o | o------> nil  ;;
;;     +-|-+---+     +-|-+---+     +-|-+---+           ;;
;;       |             |             |                 ;;
;;       +---> 1       +---> 2       +---> 3           ;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

()
;;비어 있는 리스트

(cons 1 ())
(cons 1 nil)
(cons 1 (cons 2 nil))
(cons 1 (cons 2 (cons 3 nil)))
(list 1 2 3)
